--  !!! В выходной выборке должны присутствовать только запрашиваемые в условии поля.
use qalight;
-- 1. Напишите один запрос с использованием псевдонимов для таблиц и псевдонимов полей, 
--    выбирающий все возможные комбинации городов (CITY) из таблиц 
--    STUDENTS, LECTURERS и UNIVERSITIES
--    строки не должны повторяться, убедитесь в выводе только уникальных троек городов
--    Внимание: убедитесь, что каждая колонка выборки имеет свое уникальное имя

select distinct ST.CITY, LC.CITY, UV.CITY
  from STUDENTS as ST, LECTURERS as LC, UNIVERSITIES as UV;
		 
-- 2. Напишите запрос для вывода полей в следущем порядке: семестр, в котором он
--    читается, идентификатора (номера ID) предмета обучения, его наименования и 
--    количества отводимых на этот предмет часов для всех строк таблицы SUBJECTS

select semester, id, name, hours 
  from subjects
order by semester, id, name, hours;
-- 3. Выведите все строки таблицы EXAM_MARKS, в которых предмет обучения SUBJ_ID равен 4
select * 
  from EXAM_MARKS
 where SUBJ_ID=4;

-- 4. Необходимо выбирать все данные, в следующем порядке 
--    Стипендия, Курс, Фамилия, Имя  из таблицы STUDENTS, причем интересуют
--    студенты, родившиеся после '1993-07-21'

select   stipend, course, surname, name
  from STUDENTS
 where birthday<'1993-07-21';
    
-- 5. Вывести на экран все предметы: их наименования и кол-во часов для каждого из них
--    в 1-м семестре и при этом кол-во часов не должно превышать 41

select name, hours
  from SUBJECTS
 where semester=1 and hours<=41;
        
-- 6. Напишите запрос, позволяющий вывести из таблицы EXAM_MARKS уникальные 
--    значения экзаменационных оценок, которые были получены '2012-06-12'

select distinct mark
  from EXAM_MARKS
 where exam_date='2012-06-12';

-- 7. Выведите список фамилий студентов, обучающихся на третьем и последующих 
--    курсах и при этом проживающих не в Киеве, не Харькове и не Львове.

select surname
 from STUDENTS
where course>=3 and city<>'Киев'
				and city<>'Харьков'
				and city<>'Львов';

-- 8. Покажите данные о фамилии, имени и номере курса для студентов, 
--    получающих стипендию в диапазоне от 450 до 650, не включая 
--    эти граничные суммы. Приведите несколько вариантов решения этой задачи.

select SURNAME, NAME, COURSE
  from STUDENTS
 where STIPEND between 450 and 650;

select SURNAME, NAME, COURSE
  from STUDENTS
 where STIPEND>450 and STIPEND<650;
        

-- 9. Напишите запрос, выполняющий выборку из таблицы LECTURERS всех фамилий
--    преподавателей, проживающих во Львове, либо же преподающих в университете
--    с идентификатором 14
 
select surname 
  from LECTURERS
 where city='Львов' or univ_id=14;

-- 10. Выясните в каких городах (названия) расположены университеты,  
--     рейтинг которых составляет 528 +/- 47 баллов.

select * 
  from universities
 where rating between 481 and 575;

-- 11. Отобрать список фамилий киевских студентов, их имен и дат рождений 
--     для всех нечетных курсов.

select surname, name, birthday
  from students   
 where course in (1, 3, 5) and city='Киев';

-- 12. Упростите выражение фильтрации (избавтесь от NOT) и дайте логическую формулировку запроса?
-- SELECT * FROM STUDENTS WHERE (STIPEND < 500 OR NOT (BIRTHDAY >= '1993-01-01' AND ID > 9))
-- Подсказка: после упрощения, запрос должен возвращать ту же выборку, что и оригинальный

-- (Выбрать из таблицы "Студенты", родившихся до даты  1993-01-01 и у них 
-- ID меньше или равно 9 и со степендией меньше 500).

SELECT * 
  FROM STUDENTS 
 WHERE STIPEND < 500 OR BIRTHDAY <'1993-01-01' or ID <= 9;
    
-- 13. Упростите выражение фильтрации (избавтесь от NOT) и дайте логическую формулировку запроса?
-- SELECT * FROM STUDENTS WHERE NOT ((BIRTHDAY = '1993-06-07' OR STIPEND > 500) AND ID >= 9)
-- Подсказка: после упрощения, запрос должен возвращать ту же выборку, что и оригинальный

-- (Выбрать студентов с датой рождения не равной 1993-06-07 и степендией меньше или равно 500 или с ID 
-- меньше 9).

SELECT * 
  FROM STUDENTS 
 WHERE  BIRTHDAY<> '1993-06-07' and STIPEND <= 500 or ID < 9;
